[省流:考试寄掉,交白卷可以得45/100分,咱只拿了15分]
就稍微debug了下线段树,结果就把生日给晃过去了呢......
但是今年可以说是咱出生以来最惨的一次生日
不是其他原因,就是因为今天(前天?)出了CSP-S成绩
咱也不是没想过因为实力不足而没有拿到1=...但是不能接受的是因为CCF的愚蠢数据和1=错过 
谁能想到,咱考场上写了半个小时的程序得了15分(该题满分100)
然后**这道题交白卷可以得45分???**
怎么可能辛苦写的程序还不如交白卷分数高?  CCF 我***
你不会造数据我来教你造啊,多组数据懂不懂是拿来干什么的?!
神TM答案全输出"No"可以有45分,你是怎么想的?真就完全随机数据呗??
知不知道民间数据全输出"No"只有5分啊?知不知道民间数据都构造了两天啊?
CCF你TM不会直接输出rand()作为数据吧?
你坑的钱就是拿来写一个rand()数据的吗?!
本来还写了一长串的小作文炮打CCF的,不过冷静下来就觉得没必要了,反正成绩已经是既定事实了
其实如果咱实力够强,写出T1的满分暴力(这也是因为CCF的傻X数据而放过去的错误解)也是可以拿一等的...
考试失利可能的确是咱实力不够吧,但是CCF犯下的煞笔一般的学术性错误肯定是对所有OIer的不负责
所以咱只有一句经典老话:F**k CCF 
